yii2test/frontend/controllers/SignController.php

	public function actionLogin(){
		$data = Yii::$app->request->post();
		if($data){

			//查询用户
			$user = $this->userObj->find()
    				->where(['username' => $data['username']])
    				->asArray()
    				->one();

			//判断用户信息
    		if(!$user) exit('用户名不存在');
    		if($user['password'] != $data['password']) exit('密码错误');

    		//存session
    		$this->session->set('uid', $user['uid']);

            //判断是不是第一次登陆
            if( $user['lastsigntime'] ){

                //计算距上次签到有多久
                $diff = strtotime(date('Y-m-d')) - strtotime($user['lastsigntime']);

                //如果已经断更
                if( $diff > 3600*24 ){

                    //跟新用户信息
                    $_userObj = clone $this->userObj;
                    $_userObj = $_userObj->findOne(['uid' => $user['uid']]);
                    $_userObj->day_sum = 0;
                    $_userObj->save();
---
SELECT * FROM `user` WHERE `username`='谷向阳1'
SELECT * FROM `user` WHERE `uid`='1'
UPDATE `user` SET `day_sum`=0 WHERE `uid`=1

                        $time = strtotime($user['lastsigntime']) + 3600*24*$i;
                        $_signObj->date = date('Y-m-d',$time);
                        $_signObj->uid = $user['uid'];
                        $_signObj->insert();
---
INSERT INTO `sign` (`date`, `uid`) VALUES ('2017-12-10', 1)

	public function actionSign(){
		$uid = $this->session->get('uid');

        //判断非法登陆
        if(!$uid){
            exit('请先登陆');
        }

        //查询用户表
        $user = $this->userObj->find()
                ->where(['uid' => $uid])
                ->asArray()
                ->one();
---
SELECT * FROM `user` WHERE `uid`='1'

        foreach ($sign as $key => $value) {
            $_signObj->$key = $value;
        }
        $_signObj->insert();

        //更新用户数据
        $_userObj = clone $this->userObj;
        $_userObj = $_userObj->findOne(['uid'=>$user['uid']]);
        foreach ($user as $key => $value) {
            $_userObj->$key = $value;
        }
        $_userObj->update();
---
INSERT INTO `sign` (`date`, `static`, `uid`, `sanction`) VALUES ('2017-12-09', 1, 1, '2')
SELECT * FROM `user` WHERE `uid`='1'
UPDATE `user` SET `uid`=1, `gold_sum`=1003, `day_sum`=2, `lastsigntime`='2017-12-09' WHERE `uid`=1

    public function actionShow(){
        $uid = $this->session->get('uid');

        //判断非法登陆
        if(!$uid){
            exit('请先登陆');
        }

        //查询用户
        $res = $this->userObj->find()
                ->where(['uid' => $uid])
                ->asArray()
                ->one();

        //计算十天前的日期
        $date = strtotime(date('Y-m-d'))-3600*240;
        $date = date('Y-m-d',$date);

        //查询可以补签的详情
        $arr = $this->signObj->find()
                ->where(['and',['uid'=>$uid],['static'=>0],['>=','date',$date]])
                ->asArray()
                ->all();
---
SELECT * FROM `user` WHERE `uid`='1'
SELECT * FROM `sign` WHERE (`uid`='1') AND (`static`=0) AND (`date` >= '2017-12-05')

    public function actionUpdate($id){
        $uid = $this->session->get('uid');

        //判断非法登陆
        if(!$uid){
            exit('请先登陆');
        }

        //查询用户
        $user = $this->userObj->find()
                ->where(['uid' => $uid])
                ->asArray()
                ->one();

        //判断钱够不够
        if( ! ($user['gold_sum'] >= 100) ){
            exit('金币不足');
        }

        //修改详情表
        $_signObj = clone $this->signObj;
        $_signObj = $_signObj->findOne(['id'=>$id]);
        $_signObj->static = 2;
        $_signObj->sanction = 0-100;
        $_signObj->save();

        //计算连续签到天数
        $oneDay = $this->signObj->find()
                        ->where(['or',['uid'=>$uid,'static'=>0],['sanction'=>105]])
                        ->orderBy('date desc')
                        ->asArray()
                        ->one();
---
SELECT * FROM `user` WHERE `uid`='1'
SELECT * FROM `sign` WHERE `id`='4'
UPDATE `sign` SET `static`=2, `sanction`='-100' WHERE `id`=4
SELECT * FROM `sign` WHERE ((`uid`='1') AND (`static`=0)) OR (`sanction`=105) ORDER BY `date` DESC


        //跟新用户信息
        $_userObj = clone $this->userObj;
        $_userObj = $_userObj->findOne(['uid'=>$uid]);
---
SELECT * FROM `user` WHERE `uid`='1'

            $_userObj->gold_sum = $user['gold_sum']-100;
        }
        $_userObj->day_sum = $day_sum;
        $_userObj->save();
---
UPDATE `user` SET `gold_sum`=405, `day_sum`=9 WHERE `uid`=1